app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'hugo'
AND `is_aktif` = 1
 LIMIT 1
---
		    public function login()
{
    if ($this->request->getPost()) {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $dataUser = $this->user->where(['username' => $username, 'is_aktif' => true])->first();