app/Controllers/KelolaUserController.php

SELECT *
FROM `user`
---
    public function index()
    {
        $data = [
            'users' => $this->userModel->findAll()
        ];