app/Controllers/TransaksiController.php

INSERT INTO `transaksi` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_by`, `created_date`) VALUES ('hugo', '1399710', 'Ex-Asrama Brigif V, K38/4, RT03/03, Banyumanik, Semarang Selatan', '11000', 0, 'hugo', '2023-07-06 14:27:51')
---
        public function buy()
        {
            if($this->request->getPost())
            {
                $data = $this->request->getPost();

                $transaksiModel = new \App\Models\TransaksiModel();
                $transaksiDetailModel = new \App\Models\TransaksiDetailModel();

                $dataForm = [
                    'username' => $this->request->getPost('username'),
                    'total_harga' => $this->request->getPost('total_harga'),
                    'alamat' => $this->request->getPost('alamat'),
                    'ongkir' => $this->request->getPost('ongkir'),
                    'status' => 0,
                    'created_by' => $this->request->getPost('username'),
                    'created_date' => date("Y-m-d H:i:s")
                ];

                $transaksiModel->insert($dataForm);

INSERT INTO `transaksi_detail` (`id_transaksi`, `id_barang`, `jumlah`, `diskon`, `subtotal_harga`, `created_by`, `created_date`) VALUES (2, '1', 1, 0, 1000000, 'hugo', '2023-07-06 14:27:51')
---
                        'created_date' => date("Y-m-d H:i:s")
                    ];

                    $transaksiDetailModel->insert($dataFormDetail);